================================================================================
simple decimal floating point
================================================================================
3.14;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with exponent
================================================================================
1.23e-4;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with positive exponent
================================================================================
1.5e+10;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with f suffix
================================================================================
3.14f;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with F suffix
================================================================================
2.5F;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with d suffix
================================================================================
1.0d;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point with D suffix
================================================================================
42.0D;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point without leading zero
================================================================================
.5;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
floating point without trailing digits
================================================================================
5.;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))

================================================================================
hexadecimal floating point
================================================================================
0x1.fp3;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (hex_floating_point_literal)))

================================================================================
large floating point with underscores
================================================================================
123_456.789_012;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (decimal_floating_point_literal)))